---
kind: method
id: M:Autodesk.Revit.DB.Structure.ConnectionInputPoint.#ctor
source: html/1c7f40e7-c627-ab86-d800-389a32504625.htm
---
# Autodesk.Revit.DB.Structure.ConnectionInputPoint.#ctor Method

Construct a default input point.

## Syntax (C#)
```csharp
public ConnectionInputPoint()
```